Revit 2024 API
Generic.GenericSelfIllumLuminance Property
 The property labeled "Luminance" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GenericSelfIllumLuminance { get; }
Visual Basic
Public Shared ReadOnly Property GenericSelfIllumLuminance As String
	Get
Visual C++
public:
static property String^ GenericSelfIllumLuminance {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace